Revit 2027 API
FabricationPart.GetTransform Method
 Gets the transformation matrix of the fabrication part element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Transform GetTransform()
Public Function GetTransform As Transform
public:
Transform^ GetTransform()
member GetTransform : unit -> Transform
Return Value
Transform
 The transformation matrix of the fabrication part element.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace